## Association Rule

In [1]:
#-->>Example we buyying the phone in the flipkart it shows 
#the related products like charger,phone cover,etc is called
#AR

In [2]:
!pip install  mlxtend

Requirement already satisfied: mlxtend in c:\users\yella\anaconda3\lib\site-packages (0.23.4)
Requirement already satisfied: scipy>=1.2.1 in c:\users\yella\anaconda3\lib\site-packages (from mlxtend) (1.11.1)
Requirement already satisfied: numpy>=1.16.2 in c:\users\yella\anaconda3\lib\site-packages (from mlxtend) (1.24.3)
Requirement already satisfied: pandas>=0.24.2 in c:\users\yella\anaconda3\lib\site-packages (from mlxtend) (2.0.3)
Requirement already satisfied: scikit-learn>=1.3.1 in c:\users\yella\anaconda3\lib\site-packages (from mlxtend) (1.6.1)
Requirement already satisfied: matplotlib>=3.0.0 in c:\users\yella\anaconda3\lib\site-packages (from mlxtend) (3.7.2)
Requirement already satisfied: joblib>=0.13.2 in c:\users\yella\anaconda3\lib\site-packages (from mlxtend) (1.2.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (9.4.0)
Requirement already satisfied: pyparsing<3.1,>=2.3.1 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\yella\anaconda3\lib\site-packages (from matplotlib>=3.0.0->mlxtend) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\yella\anaconda3\lib\site-packages (from pandas>=0.24.2->mlxtend) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\yella\anaconda3\lib\site-packages (from pandas>=0.24.2->mlxtend) (2023.3)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\yella\anaconda3\lib\site-packages (from scikit-learn>=1.3.1->mlxtend) (3.5.0)
Requirement already satisfied: six>=1.5 in c:\users\yella\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib>=3.0.0->mlxtend) (1.16.0)

In [3]:
import numpy as np
import pandas as pd
from mlxtend.frequent_patterns import apriori 
from mlxtend.frequent_patterns import association_rules
import warnings
warnings.filterwarnings('ignore')

In [4]:
titanic=pd.read_csv(r"C:\Users\yella\Desktop\Titanic.csv")
titanic.head()

  Class Gender    Age Survived
0   3rd   Male  Child       No
1   3rd   Male  Child       No
2   3rd   Male  Child       No
3   3rd   Male  Child       No
4   3rd   Male  Child       No

In [5]:
#The get_dummies method is a powerful tool for encoding categorical variables into numerical
#representations, specifically using one-hot encoding.
#label encoding-->>

In [6]:
titanic.isnull().sum()

Class       0
Gender      0
Age         0
Survived    0
dtype: int64

In [7]:
titanic['Gender'].unique()  # for checking the unique values

array(['Male', 'Female'], dtype=object)

In [8]:
titanic.describe()

       Class Gender    Age Survived
count   2201   2201   2201     2201
unique     4      2      2        2
top     Crew   Male  Adult       No
freq     885   1731   2092     1490

In [9]:
titanic.shape

(2201, 4)

In [10]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2201 entries, 0 to 2200
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Class     2201 non-null   object
 1   Gender    2201 non-null   object
 2   Age       2201 non-null   object
 3   Survived  2201 non-null   object
dtypes: object(4)
memory usage: 68.9+ KB

In [11]:
df=pd.get_dummies(titanic,dtype='int')
df.head()

,Class_1st,Class_2nd,Class_3rd,Class_Crew,Gender_Female,Gender_Male,Age_Adult,Age_Child,Survived_No,Survived_Yes
0,0,0,1,0,0,1,0,1,1,0
1,0,0,1,0,0,1,0,1,1,0
2,0,0,1,0,0,1,0,1,1,0
3,0,0,1,0,0,1,0,1,1,0
4,0,0,1,0,0,1,0,1,1,0

# Appriori Algorithm

In [21]:
frequent_itemsets=apriori(df,min_support=0.3, use_colnames=True)
frequent_itemsets.head(10)

    support                   itemsets
0  0.320763                (Class_3rd)
1  0.402090               (Class_Crew)
2  0.786461              (Gender_Male)
3  0.950477                (Age_Adult)
4  0.676965              (Survived_No)
5  0.323035             (Survived_Yes)
6  0.391640  (Gender_Male, Class_Crew)
7  0.402090    (Age_Adult, Class_Crew)
8  0.305770  (Survived_No, Class_Crew)
9  0.757383   (Gender_Male, Age_Adult)

In [22]:
type(frequent_itemsets)

pandas.core.frame.DataFrame

In [41]:
rules = association_rules(frequent_itemsets, metric="lift", min_threshold=1, num_itemsets = len(frequent_itemsets))

In [42]:
rules.head()

,antecedents,consequents,antecedent support,consequent support,support,confidence,lift,representativity,leverage,conviction,zhangs_metric,jaccard,certainty,kulczynski
0,(Gender_Male),(Class_Crew),0.786461,0.402090,0.39164,0.497978,1.238474,1.0,0.075412,1.191004,0.901730,0.491448,0.160372,0.735995
1,(Class_Crew),(Gender_Male),0.402090,0.786461,0.39164,0.974011,1.238474,1.0,0.075412,8.216621,0.322047,0.491448,0.878295,0.735995
2,(Age_Adult),(Class_Crew),0.950477,0.402090,0.40209,0.423040,1.052103,1.0,0.019913,1.036311,1.000000,0.423040,0.035039,0.711520
3,(Class_Crew),(Age_Adult),0.402090,0.950477,0.40209,1.000000,1.052103,1.0,0.019913,inf,0.082827,0.423040,1.000000,0.711520
4,(Survived_No),(Class_Crew),0.676965,0.402090,0.30577,0.451678,1.123325,1.0,0.033569,1.090436,0.339858,0.395417,0.082935,0.606065